<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ContractServiceTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            ['name' => 'Подбор на служители от трети страни, процедура за издаване на разрешение за пребиваване и работа в Р.България (ЕРПР1)'],
            ['name' => 'Изготвяне на документи за издаване на разрешение за пребиваване и работа в Р.България (ЕРПР 1)'],
            ['name' => 'Такса за виза D платена в посолство на Република България (ЕРПР 1)'],
            ['name' => 'Процедура по удължаване на престой и работа (ЕРПР 1)'],

            ['name' => 'Подбор на служители от трети страни, процедура за издаване на разрешение за пребиваване и работа в Р.България (ЕРПР 2)'],
            ['name' => 'Изготвяне на документи за издаване на разрешение за пребиваване и работа в Р.България (ЕРПР 2)'],
            ['name' => 'Такса за виза D платена в посолство на Република България (ЕРПР 2)'],
            ['name' => 'Процедура по удължаване на престой и работа (ЕРПР 2)'],

            ['name' => 'Подбор на служители от трети страни, процедура за издаване на разрешение за пребиваване и работа в Р.България (ЕРПР 3)'],
            ['name' => 'Изготвяне на документи за издаване на разрешение за пребиваване и работа в Р.България (ЕРПР 3)'],
            ['name' => 'Такса за виза D платена в посолство на Република България (ЕРПР 3)'],
            ['name' => 'Процедура по удължаване на престой и работа (ЕРПР 3)'],

            ['name' => 'Подбор на служители от трети страни, процедура за регистрация на сезонна заетост'],
            ['name' => 'Изготвяне на документи за сезонна заетост'],
            ['name' => 'Такса за виза C платена в посолство на Република България'],

            ['name' => 'Организиране на транспорт на служители от/до България'],
            ['name' => 'Съдействие и транспорт на служители в София'],
            ['name' => 'Закупуване на медицински застраховки за служители за една година'],

            ['name' => 'Плащане на държавна такса към Дирекция Миграция – обикновена поръчка'],
            ['name' => 'Плащане на държавна такса към Дирекция Миграция – бърза поръчка'],
            ['name' => 'Плащане на държавна такса към Дирекция Миграция – експресна поръчка'],

            ['name' => 'Съдействие за превод и легализация на Свидетелство за съдимост'],

            ['name' => 'Управление на наети жилища'],
            ['name' => 'Адресна регистрация'],
            ['name' => 'Консултация за преглед на документи'],
            ['name' => 'Осигуряване на хранителни продукти'],
            ['name' => 'Услуга по административно съдействие'],
            ['name' => 'Удостоверение за психологическа годност'],
            ['name' => 'Професионална компетентност'],
            ['name' => 'Подмяна на свидетелство за управление на МПС'],
            ['name' => 'Издаване на медицинско свидетелство'],
        ];



        foreach ($data as $item) {
            \App\Models\ContractServiceType::firstOrCreate(['name' => $item['name']]);
        }
    }
}
