<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ContractServiceTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            ['name' => 'Подбор на служители от трети страни, процедура за издаване на разрешение за пребиваване и работа в Р.България'],
            ['name' => 'Изготвяне на документи за издаване на разрешение за пребиваване и работа в Р.България'],
            ['name' => 'Такса за виза D платена в посолство на Република България'],
            ['name' => 'Процедура по удължаване на престой и работа'],
            ['name' => 'Организиране на транспорт на служители от/до България'],
            ['name' => 'Закупуване на медицински застраховки за служители за една година'],
            ['name' => 'Плащане на държавна такса към Дирекция Миграция – обикновена поръчка'],
            ['name' => 'Плащане на държавна такса към Дирекция Миграция – бърза поръчка'],
            ['name' => 'Плащане на държавна такса към Дирекция Миграция – експресна поръчка'],
            ['name' => 'Съдействие и транспорт на служители в София'],
            ['name' => 'Съдействие за превод и легализация на Свидетелство за съдимост'],
            ['name' => 'Подбор на служители от трети страни, процедура за регистрация на сезонна заетост'],
            ['name' => 'Изготвяне на документи за сезонна заетост'],
            ['name' => 'Такса за виза C платена в посолство на Република България']
        ];

        foreach ($data as $item) {
            $ContractServiceType = new \App\Models\ContractServiceType();
            $ContractServiceType->name = $item['name'];
            $ContractServiceType->save();
        }
    }
}
